["إيه","هو","oauth","في","منصة","mgzon؟","mgzon","بروتوكول","يسمح","لتطبيقات","الطرف","الثالث","بالوصول","للموارد","بأمان","باستخدام","توكنات","(access","tokens)","بدل","كلمات","السر.","بيسمح","للمستخدمين","بمشاركة","بياناتهم","أو","التحكم","فيها","بدون","كشف","بيانات","حساسة.","الجواب","مستخلص","من","قسم","`introduction`","وتحديداً","`t('oauth.introductiondesc')`","اللي","بيشرح","الهدف","oauth.","لو","عايز","تبدأ،","اقرأ","الـ","introduction","وثائق","لفهم","الأساسيات،","وبعدها","روح","على","setup","لإنشاء","تطبيق.","ليه","نستخدم","مع","بيوفر","طريقة","آمنة","وسهلة","للوصول","لـ","apis","بتاعة","mgzon،","زي","إدارة","المنتجات،","الطلبات،","الإعلانات،","الحاجة","لمشاركة","تسجيل","الدخول.","الملف","بيوضح","إن","بيستخدم","لتفويض","الوصول","(scopes)","لموارد","معينة","profile:read","products:write.","ركز","scopes","عشان","تعرف","إزاي","تختار","الصلاحيات","المناسبة","لتطبيقك.","أنا","مطور","جديد،","أبدأ","ابدأ","بقراءة","mgzon.","هتساعدك","تفهم","تسجل","تطبيق،","تستخدم","flow،","وتحصل","للموارد.","هيديك","نظرة","عامة،","وقسم","هيشرح","الخطوات","بالتفصيل.","السؤال","عام","ومناسب","لمبتدئ،","فالجواب","بيربط","المستخدم","بالقسم","المناسب","(introduction","وsetup).","بإنشاء","تطبيق","عبر","إرسال","طلب","post","إلى","`/api/v1/clients`","ما","موضح","setup.","الفرق","بين","استخدام","وapi","key","بتفويض","تطبيقات","باسمهم","مؤقتة.","أما","api","فهو","المباشر","(زي","المنتجات","المخزون)","تفويض","المستخدم،","وعادة","بيستخدمه","البائعين.","بيفرق","(في","flow","وendpoints)","sellersetup).","بتعمل","لمستخدمين،","استخدم","بتدير","موارد","كبائع،","sellersetup.","أسجل","أرسل","`${process.env.next_public_base_url}/api/v1/clients`","headers:","-","`authorization:","bearer","your_access_token`","`content-type:","application/json`","والبيانات:","```json","{","\"name\":","\"myapp\",","\"redirecturis\":","[\"https://your-app.com/callback\"],","\"scopes\":","[\"profile:read\",","\"products:write\"]","}","```","الاستجابة","هتكون","بتفاصيل","التطبيق","`clientid`","و`clientsecret`.","مباشر","`setup`","الكود،","تحديداً","مثال","`codeblock`","الأول.","تأكد","عندك","access","token","صالح،","واختار","السكوبات","scopes.","هيحصل","بعد","oauth؟","التطبيق،","هتحصل","استجابة","json","تحتوي","على:","`clientid`:","معرف","التطبيق.","`clientsecret`:","سر","`name`:","اسم","`redirecturis`:","الروابط","المسموحة.","`scopes`:","الممنوحة.","`createdat`:","تاريخ","الإنشاء.","موضحة","الثاني","احفظ","و`clientsecret`","مكان","آمن،","هتحتاجهم","flow.","أعمل","يقرأ","الأولى؟","أول","خطوة","هي","السكوب","`profile:read`.","كده،","تحصل","token.","بيطلب","خطوات","عملية،","بيركز","الخطوة","الأولى","التوكن","طلبات","api.","المطلوب","يتكامل","تحتاج","بإرسال","تحديد","redirect","uris،","والسكوبات","هتحتاجها","`products:read`","`orders:write`).","لاستخدامهم","عام،","بيغطي","النقاط","الأساسية","بتكامل","منصات","بيع،","شوف","sellerintegrations","أنشئ","`${process.env.next_public_base_url}/api/v1/keys`","مع:","\"my","seller","key\",","\"permissions\":","[\"products:read\",","\"products:write\",","\"inventory:read\",","\"inventory:write\"]","هتديك","`key`","وتفاصيل","أخرى.","`sellersetup`،","المخزون","(شوف","sellerintegrations).","sellersetup","permissions","وscopes","بتستخدم","لتحديد","صلاحيات","`profile:read`)","وبتتطلب","موافقة","المستخدم.","keys","للبائعين","`products:write`)","مستخدم.","بينهما","قسمي","وsellersetup.","وصول","مناسبة.","بائع،","أتحكم","منتجاتي","غير","أشارك","بياناتي؟","خلال","`/api/v1/keys`","تحتاجها","`inventory:write`).","هيخليك","تتحكم","والمخزون","مشاركة","بيستهدف","البائعين،","والجواب","مبني","جرّب","الكود","الموجود","`sellerapikeyjs`","المفتاح","بسهولة.","أتمتة","لإدارة","المخزون،","أفضل","طريقة؟","بصلاحيات","`inventory:read`","و`inventory:write`.","`/api/v1/keys`،","استخدمه","`/api/products/sync`","لمزامنة","المخزون.","حل","عملي،","وsellerintegrations.","`syncinventory`","لكود","جاهز.","المتاحة","تشمل:","`profile:read`:","قراءة","`profile:write`:","تعديل","`products:read`:","المنتجات.","`products:write`:","إنشاء","`orders:read`:","الطلبات.","`orders:write`:","`customers:read`:","العملاء.","`customers:write`:","`inventory:read`:","`inventory:write`:","`analytics:read`:","التحليلات.","`ads:read`:","الإعلانات.","`ads:write`:","جدول","`scopes`.","اختار","بناءً","احتياجات","تطبيقك،","وحددها","أثناء","أطلب","سكوب","معين","flow؟","أضف","المطلوبة","(مثل","`profile:read","products:write`)","query","string","لطلب","authorization:","```javascript","const","authurl","=","`${process.env.next_public_base_url}/api/auth/mgz?client_id=${clientid}&redirect_uri=${redirecturi}&scope=profile:read%20products:write&state=state`;","`scopesexample`","بتطلبها","مدعومة","ومطابقة","للسكوبات","المسجلة","بتعديل","منتجاتهم،","أحتاجها؟","هتحتاج","`products:write`","تسمح","تقرأ","كمان،","`products:read`.","بيحدد","وظيفة","معينة،","دي","وفي","هل","لازم","كل","ولا","أختار","أحتاجها","بس؟","بس","تقلل","المخاطر","الأمنية","وتحسن","تجربة","سكوبات","زيادة","ممكن","يخلي","يرفض","التفويض.","بيشدد","اختيار","راجع","الوثائق","وحدد","يناسب","تطبيقك.","أستورد","منتجات","shopify","`/api/products/import`","your_api_key`","\"provider\":","\"shopify\",","\"productid\":","\"shopify_product_id\",","\"sellerid\":","\"your_seller_id\",","\"region\":","\"us\"","هتعطيك","تفاصيل","المنتج","المستورد.","`importproducts`","sellerintegrations.","بصلاحية","`products:write`.","هتظهر","الاستيراد؟","هتتضمن:","`_id`:","المنتج.","`title`:","`description`:","وصف","`price`:","السعر.","`sku`:","رمز","`quantity`:","الكمية.","`currency`:","العملة.","`region`:","المنطقة.","`sellerid`:","البائع.","`source`:","المصدر","shopify).","`sourceid`:","المصدر.","`importproductsresponse`","الملف.","البيانات","عندي","متجر","shopify،","أنقل","وأرسل","shopify.","حدد","`provider`","كـ","\"shopify\"","وأدخل","`productid`","و`sellerid`.","عملي","للبائعين،","الاستيراد","كود","javascript","أقدر","أمزامن","تلقائياً","ومنصة","أخرى؟","أيوه،","`inventory:write`.","أدخل","`productid`،","shopify)،","و`sellerid`","أتمتة،","بيعتمد","`sellerintegrationsjs`","لإعداد","الأتمتة.","1.","وجه","`/api/auth/mgz`","`client_id`،","`redirect_uri`،","`scope`،","و`state`.","2.","بيوافق","الصلاحيات.","3.","بتعيد","توجيه","`redirect_uri`","`code`.","4.","`/api/token`","`code`،","`client_secret`،","و`redirect_uri`","`access_token`","و`refresh_token`.","5.","مثل","`/api/userinfo`.","`flow`،","`flowdesc`","ومثال","`flowexample`.","node.js","`flowexample`","لتنفيذ","أحصل","المستخدم؟","\"grant_type\":","\"authorization_code\",","\"code\":","\"auth_code\",","\"client_id\":","\"your_client_id\",","\"client_secret\":","\"your_client_secret\",","\"redirect_uri\":","\"your_redirect_uri\"","`access_token`،","`refresh_token`،","و`expires_in`.","`tokenendpoint`","endpoints.","`refresh_token`","لتجديد","لما","ينتهي.","أخلي","تطبيقي","يطلب","لبياناته؟","معايير","و`scope`.","يوافق،","`code`","تستخدمه","للحصول","`access_token`.","شرح","مبسط","للـ","العملية.","انتهى،","أعمل؟","\"refresh_token\",","\"refresh_token\":","\"your_client_secret\"","جديد.","`refreshtoken`","قاعدة","آمنة.","النهائية","`/api/auth/mgz`:","لبدء","authorization","`/api/token`:","`/api/userinfo`:","لجلب","`endpoints`","endpoints","المناسب.","أجيب","get","`/api/userinfo`","access_token`","`sub`،","`email`،","`name`،","`userinfoendpoint`","صالح","وله","أعرف","إيميل","سجل","دخول،","header.","الإيميل","حقل","`email`.","`userinfoendpoint`.","`fetchuserinfo`","errors","لمعالجة","الأخطاء.","أعمله","يوافق","التطبيق؟","`redirect_uri`.","التالية","`tokenendpoint`.","الأخطاء","أواجهها","`invalid_request`:","الطلب","ناقص","فيه","غلط.","`invalid_client`:","`client_id`","`client_secret`","`invalid_grant`:","صالح.","`unauthorized_client`:","مش","مصرح","له","بالسكوبات","المطلوبة.","`unsupported_grant_type`:","نوع","grant","مدعوم.","`integration_not_found`:","التكامل","موجود.","`integration_not_connected`:","متصل.","`errors`.","واجهت","خطأ.","أتعامل","خطأ","`invalid_request`؟","`invalid_request`","بيحصل","من:","المعايير","`redirect_uri`)","موجودة.","صيغة","صحيحة","(مثلاً،","`scope`","مفصول","بمسافات).","errors.","معالجة","`errorsexample`.","بيطلع","لي","أحاول","token؟","يكون","بسبب","(معايير","ناقصة)","`invalid_client`","(بيانات","غلط).","`/api/token`.","الشائعة","وتأكد","المعايير.","رجّع","خطأ،","المشكلة؟","الخطأ","`invalid_grant`","`integration_not_found`)","وقارنه","بجدول","وسبب.","أخطاء","المثال","حملة","إعلانية","`/api/seller/ads?sandbox=false`","البيانات:","\"integrationid\":","\"integration_id\",","\"summer","sale","campaign\",","\"budget\":","\"amount\":","1000,","\"currency\":","\"usd\"","},","\"schedule\":","\"startdate\":","\"2025-08-18t10:00:00.000z\",","\"enddate\":","\"2025-09-18t10:00:00.000z\"","\"creatives\":","[","\"type\":","\"image\",","\"url\":","\"https://example.com/ad.jpg\",","\"dimensions\":","\"width\":","1200,","\"height\":","600","],","\"products\":","[\"product_id_1\",","\"product_id_2\"],","\"targeting\":","\"regions\":","[\"us\",","\"eu\"],","\"demographics\":","\"age\":","\"18-45\",","\"gender\":","\"all\"","`createadcampaign`","advertising.","`ads:write`.","advertising","أشوف","الحملات","الإعلانية","بتاعتي؟","`/api/seller/ads`","`accept:","قائمة","بالحملات","`_id`،","و`status`.","`listadcampaigns`","لعرض","الحملات.","إعلانات","لمنتجاتي،","وين","أبدأ؟","`ads:write`،","الحملة","الاسم،","الميزانية،","والمنتجات","المستهدفة.","وadvertising.","`advertisementsjs`","`advertisementspython`","أداء","إعلاناتي","`/api/seller/ads/sync`","`campaignid`","المقاييس","(metrics)","عدد","المشاهدات،","النقرات،","والتحويلات.","`syncadmetrics`","البيانات.","أستخدم","node.js؟","مكتبة","`passport-mgzon`","كما","المثال:","express","require('express');","passport","require('passport');","mgzonstrategy","require('passport-mgzon');","passport.use(new","mgzonstrategy({","clientid:","'your_client_id',","clientsecret:","'your_client_secret',","callbackurl:","'https://your-app.com/auth/mgz/callback',","scope:","['profile:read',","'products:write']","async","(accesstoken,","refreshtoken,","profile,","done)","=>","user","id:","profile.id,","email:","profile.email,","name:","profile.name","};","return","done(null,","user);","}));","app.get('/auth/mgz',","passport.authenticate('mgzon'));","app.get('/auth/mgz/callback',","passport.authenticate('mgzon',","session:","false","}),","(req,","res)","res.redirect('/profile');","});","app.listen(3000);","`examplenode`","example.","استبدل","`your_client_id`","و`your_client_secret`","بقيم","حقيقية.","example","منتج","javascript؟","الكود:","fetch","require('node-fetch');","function","importproduct(apikey,","sellerid,","provider,","productid)","response","await","fetch('${process.env.next_public_base_url}/api/products/import',","method:","'post',","'content-type':","'application/json',","'authorization':","`bearer","${apikey}`","body:","json.stringify({","productid,","region:","'us'","})","result","response.json();","if","(!result.success)","throw","new","error(result.error);","result.data;","`examplesellerimport`","صلاحية","python،","flask","واتبع","`examplepython`","الوثائق.","`/api/auth/mgz`،","واستخدم","`examplepython`.","وركز","لمنصة","تانية؟","`/api/products/export`","`targetplatform`","shipbob)،","تصدير،","`examplesellerexport`.","`exportproduct`","javascript.","كمطور؟","createapplication(token,","name,","redirecturis,","scopes)","fetch('${process.env.next_public_base_url}/api/v1/clients',","${token}`","`developerscreateapp`","developers.","المناسبة.","developers","التطبيقات","سجلتها؟","your_access_token`.","بكل","التطبيقات.","`developerslistapps`","`listapplications`","الخطوات؟","والسكوبات.","`developerscreateapp`.","لمزيد","التفاصيل.","أدير","أكتر","تشوف","سجلتها،","وأنشئ","جديدة","بطلبات","نفس","endpoint.","و`developerscreateapp`.","أتأكد","آمن","https","`clientsecret`","و`access_token`","واطلب","تحتاجها.","الموضح","بيجمع","نصايح","أمان","أقسام","setup،","scopes،","وerrors.","الأخطاء،","لاختيار","محدودة.","general","فاهم","حاجة","الشات","بوت","الصفحة","(زر","الأسفل","يمين).","سؤالك،","وهيرد","عليك","التدريب.","ميزة","أسئلة","بسيطة","بوت،","ولو","مافهمتش،","القسم","بيدعم","لغات","برمجة","وpython؟","http،","فتقدر","أي","لغة","تدعم","http","ruby،","php،","go).","الأمثلة","بـ","وpython،","المبدأ","نفسه.","`/api/auth/mgz`)","فهي","لغة-محايدة.","لغتك","المفضلة","أختبر","قبل","أنشره؟","sandbox","mode","الإعلانات","`/api/seller/ads?sandbox=true`)","تختبر","تأثير","الحقيقية.","طلباتك","بيئة","تطوير","محلية.","مذكور","اختبار.","تانية","google؟","الأساسي","مشابه","(authorization","code","grant)،","وسكوبات","خاصة","و`products:write`.","للتفاصيل.","فضولي،","بيقارن","بمعايير","القياسية.","الفروقات","والتفاصيل.","amazon،","بتوفر","والإعلانات.","بقسم","رؤية","قدرات","ثم","نسيت","بتاعي،","جديد","لأن","بيترجع","مرة","لأسباب","أمنية.","بيذكر","مباشر،","ده","إجراء","قياسي.","فور","إنشائه.","what","is","in","mgzon?","a","protocol","that","allows","third-party","applications","to","securely","resources","using","tokens","instead","of","passwords.","it","enables","users","share","or","control","their","data","without","exposing","sensitive","information.","the","answer","derived","from","'introduction'","section,","specifically","`t('oauth.introductiondesc')`,","which","explains","purpose","started,","read","section","mgzon's","documentation","understand","basics,","then","proceed","create","an","application.","why","use","with","provides","secure","and","easy","way","mgzon’s","apis,","such","as","managing","products,","orders,","ads,","sharing","login","credentials.","clarifies","used","authorize","specific","like","focus","on","how","select","appropriate","for","your","i’m","developer,","do","i","start","apis?","by","reading","documentation.","will","help","you","register","application,","flow,","obtain","resources.","gives","overview,","details","steps.","question","beginner-friendly,","so","links","relevant","sections","setup).","begin","creating","application","via","request","`/api/v1/clients`,","shown","section.","what’s","difference","between","behalf","temporary","tokens.","keys,","however,","provide","direct","(like","product","inventory","management)","authorization,","typically","sellers.","distinguishes","(in","sections)","user-facing","apps.","resource","management,","send","include","`clientsecret`.","directly","'setup'","first","ensure","have","valid","happens","after","application?","registering","you’ll","receive","containing:","identifier.","secret.","name.","allowed","uris.","granted","permissions.","creation","date.","detailed","second","store","securely,","need","them","want","build","app","reads","data,","are","steps?","first,","`profile:read`","scope.","then,","asks","practical","steps,","focuses","step","requests.","required","integrates","sending","specifying","uris,","(e.g.,","broad,","covers","core","points","integrating","sales","platforms,","check","with:","other","details.","comes","requests","products","(see","define","apps","require","consent.","sellers","authorization.","differentiates","these","sections.","access,","seller,","can","manage","my","data?","`/api/v1/keys`,","needed","lets","targets","sellers,","based","try","easily.","automate","best","approach?","`inventory:write`","sync","inventory.","solution,","ready-to-use","code.","available","include:","data.","modify","products.","orders.","customer","analytics","ad","ads.","table","choose","app’s","needs","specify","during","registration.","scope","flow?","add","desired","request:","requested","supported","match","those","registered","need?","allow","modifying","also","specifies","function,","table.","registration","all","just","ones","only","minimize","security","risks","improve","experience.","requesting","unnecessary","may","lead","deny","emphasizes","selecting","review","requires.","import","imported","product.","has","permission.","returned","importing?","includes:","description.","price.","sku.","quantity.","currency.","region.","source","id","platform.","this","store,","transfer","permission","`/api/products/import`,","'shopify'","along","`sellerid`.","solution","uses","automatically","another","platform?","yes,","`productid`,","shopify),","`sellerid`","quantities.","automation,","relies","set","up","automation.","steps","`client_id`,","`redirect_uri`,","`scope`,","`state`.","authorizes","redirects","`code`,","`client_secret`,","`refresh_token`.","`flow`","implement","authorization?","`access_token`,","`refresh_token`,","`expires_in`.","renew","when","expires.","make","consent","access?","parameters","`scope`.","approval,","exchange","simplified","explanation,","process.","expires?","part","database.","initiates","obtains","retrieves","retrieve","oauth?","`sub`,","`email`,","`name`,","email","logged-in","user,","do?","obtaining","`email`","field.","handle","should","app?","next","might","encounter","missing","invalid","parameters.","incorrect","`client_secret`.","isn’t","authorized","type","not","supported.","integration","doesn’t","exist.","connected.","`errors`","error.","error?","error","occurs","ensure:","included.","correctly","formatted","space-separated).","description","error-handling","am","getting","trying","token?","could","be","due","(missing","parameters)","(incorrect","credentials).","verify","request.","general,","common","returns","error,","identify","issue?","compare","each","cause.","handling","code,","campaign","`ads:write`","view","campaigns?","list","campaigns","`_id`,","`status`.","display","campaigns.","ads","where","start?","permission,","budget,","targeted","beginner-focused,","examples","track","performance","metrics","views,","clicks,","conversions.","library","example:","replace","`your_client_secret`","actual","values.","javascript?","code:","python,","follow","`/api/auth/mgz`,","python","handling.","export","shipbob),","exporting,","developer?","i’ve","registered?","applications.","app,","more","multiple","applications,","same","necessary","also,","combines","tips","setup,","scopes,","minimal","don’t","something","documentation,","chatbot","page","(bottom-right","chat","button).","enter","question,","respond","training","feature","mentioned","simple","questions","chatbot,","unclear,","does","support","programming","languages","than","python?","http,","any","language","supports","ruby,","php,","but","principles","same.","making","language-agnostic.","preferred","test","before","publishing","it?","affecting","real","local","development","environment.","similar","platforms","google?","concept","grant),","curious,","compares","standard","practices.","differences","amazon,","broad","vision,","capabilities","apis.","management.","forget","`client_secret`?","cannot","retrieved","reasons.","practice.","immediately","creation."]